In [2]:
import pandas as pd

In [58]:
dataset = pd.read_csv('data/dataset_mood_smartphone.csv')
dataset['time']= pd.to_datetime(dataset['time'])
dataset['date'] = dataset['time'].dt.date
dataset = dataset.drop(columns=['Unnamed: 0'])

In [59]:
display(dataset)

             id                    time        variable   value        date
0       AS14.01 2014-02-26 13:00:00.000            mood   6.000  2014-02-26
1       AS14.01 2014-02-26 15:00:00.000            mood   6.000  2014-02-26
2       AS14.01 2014-02-26 18:00:00.000            mood   6.000  2014-02-26
3       AS14.01 2014-02-26 21:00:00.000            mood   7.000  2014-02-26
4       AS14.01 2014-02-27 09:00:00.000            mood   6.000  2014-02-27
...         ...                     ...             ...     ...         ...
376907  AS14.30 2014-04-11 07:51:16.948  appCat.weather   8.032  2014-04-11
376908  AS14.30 2014-04-19 11:00:32.747  appCat.weather   3.008  2014-04-19
376909  AS14.30 2014-04-26 10:19:07.434  appCat.weather   7.026  2014-04-26
376910  AS14.30 2014-04-27 00:44:48.450  appCat.weather  23.033  2014-04-27
376911  AS14.32 2014-04-07 18:25:14.036  appCat.weather  22.431  2014-04-07

[376912 rows x 5 columns]

In [60]:
# Unique IDs
n_unique_ids = len(dataset['id'].unique())
print(f'{n_unique_ids} unqiue IDs in dataset')

27 unqiue IDs in dataset

In [61]:
# Average amount of datapoints per id
n_total_datapoints = len(dataset)
print(f'{n_total_datapoints // n_unique_ids} datapoints per id on average')

13959 datapoints per id on average

In [62]:
dataset.groupby(['id', 'date', 'variable']).agg({'value': ['sum','count']})

                                             value
                                               sum count
id      date       variable
AS14.01 2014-02-17 call                   2.000000     2
        2014-02-18 call                   1.000000     1
        2014-02-19 call                   7.000000     7
                   sms                    2.000000     2
        2014-02-20 call                   2.000000     2
...                                            ...   ...
AS14.33 2014-05-30 mood                  34.000000     5
                   screen              9497.646999   110
        2014-05-31 circumplex.arousal    -2.000000     1
                   circumplex.valence     1.000000     1
                   mood                   7.000000     1

[15522 rows x 2 columns]